package com.example.project.GameLogic;

import java.util.HashMap;
import java.util.LinkedHashMap;
import java.util.Map;

public class Words {
    private Map<String,String[]> wordsMap;

    public Words(){
        wordsMap = new LinkedHashMap<>();
        initializeWords();
    }
    private void initializeWords() {
        wordsMap.put("ЯБЛОКО 5", new String[]{"блок", "кол", "лоб", "око", "бок"});
        wordsMap.put("ДИКТАНТ 6", new String[]{"такт", "танк", "нитка", "титан", "ад", "акт", "кит", "тик"});
        wordsMap.put("ПИРАМИДА 7", new String[]{"ад", "дар", "мир", "пар", "пир", "дама", "пара", "рама", "пари", "драма"});
        wordsMap.put("ВАРЕЖКА 8", new String[]{"век", "жар", "рак", "арка", "вера", "жара", "река", "каре", "варка", "кража", "рева", "вар", "рев", "еж"});
        wordsMap.put("СИРОТА 9", new String[]{"оса", "рис", "рот", "сто", "тир", "аист", "роса", "рост", "рота", "сорт", "торс", "трос", "трио", "сатир", "артос"});
        wordsMap.put("ГЕМАТОГЕН 10", new String[]{"танго", "огнемет", "гегемон", "метан", "нога", "гном", "наем", "тенге", "ген", "мат", "том", "нота", "агент", "геном", "мета"});
        wordsMap.put("КУРСАНТ 12", new String[]{"курс", "кур", "рука", "транс", "урна", "тук", "рак", "акт", "аут", "сука", "танк", "уран", "утка", "кран", "кура", "русак", "скаут", "турка", "курант", "сатурн", "струна"});
        wordsMap.put("ПОСТЕЛЬ 14", new String[]{"лес", "ось", "пес", "пол", "пот", "сто", "топ", "лето", "лось", "осел", "плот", "поле", "село", "сеть", "соль", "стол", "тело", "топь", "стоп", "лесть", "отель", "плоть", "степь", "тепло"});
        wordsMap.put("ВИНТОВКА 18", new String[]{"акт", "ива", "кит", "кот", "тик", "ток", "том", "вина", "вино", "винт", "воин", "квит", "нива", "нота", "танк", "авто", "кино", "актив", "икона", "икота", "квант", "квота", "нитка", "тоник"});
        wordsMap.put("ВОЕНКОМАТ 20", new String[]{"акт", "век", "кот", "мак", "мат", "око", "ток", "том", "нет", "атом", "веко", "вена", "енот", "кома", "мета", "нота", "овен", "окно", "отек", "танк", "тема", "авто", "вето", "венок", "ветка", "квант", "макет", "метан", "намек", "немка", "новое", "океан", "комета", "монета", "отмена", "военком"});
    }
    public Map<String, String[]> getWordsMap() {
        return wordsMap;
    }
    public String[] getAnswers(String word){
        return wordsMap.get(word);
    }
}
